; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	)
(:init
	(at plane1 city8)
	(= (capacity plane1) 5440)
	(= (fuel plane1) 664)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 6)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 8)
	(at person1 city0)
	(at person2 city8)
	(at person3 city7)
	(at person4 city1)
	(at person5 city2)
	(at person6 city3)
	(at person7 city7)
	(at person8 city6)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 507)
	(= (distance city0 city2) 804)
	(= (distance city0 city3) 632)
	(= (distance city0 city4) 673)
	(= (distance city0 city5) 852)
	(= (distance city0 city6) 574)
	(= (distance city0 city7) 697)
	(= (distance city0 city8) 563)
	(= (distance city1 city0) 507)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 837)
	(= (distance city1 city3) 744)
	(= (distance city1 city4) 678)
	(= (distance city1 city5) 957)
	(= (distance city1 city6) 672)
	(= (distance city1 city7) 555)
	(= (distance city1 city8) 602)
	(= (distance city2 city0) 804)
	(= (distance city2 city1) 837)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 734)
	(= (distance city2 city4) 659)
	(= (distance city2 city5) 524)
	(= (distance city2 city6) 767)
	(= (distance city2 city7) 941)
	(= (distance city2 city8) 817)
	(= (distance city3 city0) 632)
	(= (distance city3 city1) 744)
	(= (distance city3 city2) 734)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 978)
	(= (distance city3 city5) 968)
	(= (distance city3 city6) 668)
	(= (distance city3 city7) 700)
	(= (distance city3 city8) 672)
	(= (distance city4 city0) 673)
	(= (distance city4 city1) 678)
	(= (distance city4 city2) 659)
	(= (distance city4 city3) 978)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 969)
	(= (distance city4 city6) 670)
	(= (distance city4 city7) 542)
	(= (distance city4 city8) 910)
	(= (distance city5 city0) 852)
	(= (distance city5 city1) 957)
	(= (distance city5 city2) 524)
	(= (distance city5 city3) 968)
	(= (distance city5 city4) 969)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 780)
	(= (distance city5 city7) 549)
	(= (distance city5 city8) 715)
	(= (distance city6 city0) 574)
	(= (distance city6 city1) 672)
	(= (distance city6 city2) 767)
	(= (distance city6 city3) 668)
	(= (distance city6 city4) 670)
	(= (distance city6 city5) 780)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 912)
	(= (distance city6 city8) 723)
	(= (distance city7 city0) 697)
	(= (distance city7 city1) 555)
	(= (distance city7 city2) 941)
	(= (distance city7 city3) 700)
	(= (distance city7 city4) 542)
	(= (distance city7 city5) 549)
	(= (distance city7 city6) 912)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 568)
	(= (distance city8 city0) 563)
	(= (distance city8 city1) 602)
	(= (distance city8 city2) 817)
	(= (distance city8 city3) 672)
	(= (distance city8 city4) 910)
	(= (distance city8 city5) 715)
	(= (distance city8 city6) 723)
	(= (distance city8 city7) 568)
	(= (distance city8 city8) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city7)
	(at person2 city4)
	(at person3 city7)
	(at person4 city6)
	(at person5 city4)
	(at person6 city8)
	(at person7 city1)
	(at person8 city3)
	))

(:metric minimize (+ (* 1 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (board person2 plane1 city8)
   deleted: (at person2 city8)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 8
2. (refuel plane1 city8)
   changed: (fuel plane1) from 664 to 5440
   goals met: 1 of 8
3. (fly plane1 city8 city7)
   deleted: (at plane1 city8)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 0 to 1136, (fuel plane1) from 5440 to 4304
   goals met: 1 of 8
4. (board person7 plane1 city7)
   deleted: (at person7 city7)
   added: (in person7 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 1 of 8
5. (fly plane1 city7 city4)
   deleted: (at plane1 city7)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 1136 to 2220, (fuel plane1) from 4304 to 3220
   goals met: 1 of 8
6. (debark person2 plane1 city4)
   deleted: (in person2 plane1)
   added: (at person2 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 2 of 8
7. (fly plane1 city4 city1)
   deleted: (at plane1 city4)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 2220 to 3576, (fuel plane1) from 3220 to 1864
   goals met: 2 of 8
8. (debark person7 plane1 city1)
   deleted: (in person7 plane1)
   added: (at person7 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 8
9. (board person4 plane1 city1)
   deleted: (at person4 city1)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 8
10. (fly plane1 city1 city7)
   deleted: (at plane1 city1)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 3576 to 4686, (fuel plane1) from 1864 to 754
   goals met: 3 of 8
11. (refuel plane1 city7)
   changed: (fuel plane1) from 754 to 5440
   goals met: 3 of 8
12. (fly plane1 city7 city6)
   deleted: (at plane1 city7)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 4686 to 6510, (fuel plane1) from 5440 to 3616
   goals met: 3 of 8
13. (debark person4 plane1 city6)
   deleted: (in person4 plane1)
   added: (at person4 city6)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 8
14. (board person8 plane1 city6)
   deleted: (at person8 city6)
   added: (in person8 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 8
15. (fly plane1 city6 city3)
   deleted: (at plane1 city6)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 6510 to 7846, (fuel plane1) from 3616 to 2280
   goals met: 4 of 8
16. (debark person8 plane1 city3)
   deleted: (in person8 plane1)
   added: (at person8 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 5 of 8
17. (board person6 plane1 city3)
   deleted: (at person6 city3)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 5 of 8
18. (fly plane1 city3 city7)
   deleted: (at plane1 city3)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 7846 to 9246, (fuel plane1) from 2280 to 880
   goals met: 5 of 8
19. (refuel plane1 city7)
   changed: (fuel plane1) from 880 to 5440
   goals met: 5 of 8
20. (fly plane1 city7 city8)
   deleted: (at plane1 city7)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 9246 to 10382, (fuel plane1) from 5440 to 4304
   goals met: 5 of 8
21. (debark person6 plane1 city8)
   deleted: (in person6 plane1)
   added: (at person6 city8)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 8
22. (fly plane1 city8 city0)
   deleted: (at plane1 city8)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 10382 to 11508, (fuel plane1) from 4304 to 3178
   goals met: 6 of 8
23. (board person1 plane1 city0)
   deleted: (at person1 city0)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 6 of 8
24. (fly plane1 city0 city7)
   deleted: (at plane1 city0)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 11508 to 12902, (fuel plane1) from 3178 to 1784
   goals met: 6 of 8
25. (debark person1 plane1 city7)
   deleted: (in person1 plane1)
   added: (at person1 city7)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 8
26. (fly plane1 city7 city4)
   deleted: (at plane1 city7)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 12902 to 13986, (fuel plane1) from 1784 to 700
   goals met: 7 of 8
27. (refuel plane1 city4)
   changed: (fuel plane1) from 700 to 5440
   goals met: 7 of 8
28. (fly plane1 city4 city2)
   deleted: (at plane1 city4)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 13986 to 15304, (fuel plane1) from 5440 to 4122
   goals met: 7 of 8
29. (board person5 plane1 city2)
   deleted: (at person5 city2)
   added: (in person5 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 7 of 8
30. (zoom plane1 city2 city4)
   deleted: (at plane1 city2)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 15304 to 19258, (fuel plane1) from 4122 to 168
   goals met: 7 of 8
31. (debark person5 plane1 city4)
   deleted: (in person5 plane1)
   added: (at person5 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 8
